# 데이터 전처리 및 저장

In [1]:
import pandas as pd

In [2]:
정답_온도 = pd.read_csv("./city_temperature_answer.csv", dtype={'column_name': object}, low_memory=False)
도시별_지구_온도 = pd.read_csv("./도시별_지구_온도.csv",low_memory=False)
온도 = pd.read_csv("./온도.csv",low_memory=False)

In [3]:
정답_온도.head(1)

   Region  Country State     City  Month  Day    Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers    1.0  1.0  1995.0            64.2

In [4]:
정답_온도 = 정답_온도[:-1]

In [5]:
정답_온도.isna().sum()

Region                  0
Country                 0
State             1450990
City                    0
Month                   0
Day                     0
Year                    0
AvgTemperature          0
dtype: int64

In [6]:
정답_온도["Day"].unique()

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10., 11., 12., 13.,
       14., 15., 16., 17., 18., 19., 20., 21., 22., 23., 24., 25., 26.,
       27., 28., 29., 30., 31.,  0.])

In [7]:
정답_온도[정답_온도["Day"]==0.0]

,Region,Country,State,City,Month,Day,Year,AvgTemperature
82774,Africa,Guinea,NaN,Conakry,3.0,0.0,2008.0,-99.0
85697,Africa,Guinea,NaN,Conakry,3.0,0.0,2016.0,-99.0
92041,Africa,Guinea-Bissau,NaN,Bissau,3.0,0.0,2008.0,-99.0
146077,Africa,Malawi,NaN,Lilongwe,3.0,0.0,2012.0,-99.0
177862,Africa,Nigeria,NaN,Lagos,3.0,0.0,2008.0,-99.0
241159,Africa,Uganda,NaN,Kampala,3.0,0.0,2012.0,-99.0
1209901,North America,Mexico,NaN,Guadalajara,3.0,0.0,2012.0,-99.0
1333910,South/Central America & Carribean,Cuba,NaN,Havana,3.0,0.0,2008.0,-99.0

In [8]:
erase_index = list(정답_온도[정답_온도["Day"]==0.0].index)

In [9]:
type(erase_index)

list

In [10]:
정답_온도["Year"].unique()

array([1995., 1996., 1997., 1998., 1999., 2000., 2001., 2002., 2003.,
       2004., 2005., 2006., 2007., 2008., 2009., 2010., 2011., 2012.,
       2013., 2014., 2015., 2016., 2017., 2018., 2019., 2020.,  201.,
        200.])

In [11]:
정답_온도[정답_온도["Year"]==201.0]

,Region,Country,State,City,Month,Day,Year,AvgTemperature
58178,Africa,Ethiopia,NaN,Addis Ababa,12.0,3.0,201.0,-99.0
58179,Africa,Ethiopia,NaN,Addis Ababa,12.0,4.0,201.0,-99.0
58180,Africa,Ethiopia,NaN,Addis Ababa,12.0,5.0,201.0,-99.0
58181,Africa,Ethiopia,NaN,Addis Ababa,12.0,6.0,201.0,-99.0
58182,Africa,Ethiopia,NaN,Addis Ababa,12.0,7.0,201.0,-99.0
...,...,...,...,...,...,...,...,...
1212427,North America,Mexico,NaN,Guadalajara,12.0,27.0,201.0,-99.0
1212428,North America,Mexico,NaN,Guadalajara,12.0,28.0,201.0,-99.0
1212429,North America,Mexico,NaN,Guadalajara,12.0,29.0,201.0,-99.0
1212430,North America,Mexico,NaN,Guadalajara,12.0,30.0,201.0,-99.0
1212431,North America,Mexico,NaN,Guadalajara,12.0,31.0,201.0,-99.0

In [12]:
erase_index = erase_index + list(정답_온도[정답_온도["Year"]==201.0].index)

In [13]:
정답_온도[정답_온도["Year"]==200.0]

        Region  Country State     City  Month   Day   Year  AvgTemperature
743367  Europe  Germany   NaN  Hamburg   12.0   3.0  200.0           -99.0
743368  Europe  Germany   NaN  Hamburg   12.0   4.0  200.0           -99.0
743369  Europe  Germany   NaN  Hamburg   12.0   5.0  200.0           -99.0
743370  Europe  Germany   NaN  Hamburg   12.0   6.0  200.0           -99.0
743371  Europe  Germany   NaN  Hamburg   12.0   7.0  200.0           -99.0
...        ...      ...   ...      ...    ...   ...    ...             ...
845935  Europe   Norway   NaN     Oslo   12.0  27.0  200.0           -99.0
845936  Europe   Norway   NaN     Oslo   12.0  28.0  200.0           -99.0
845937  Europe   Norway   NaN     Oslo   12.0  29.0  200.0           -99.0
845938  Europe   Norway   NaN     Oslo   12.0  30.0  200.0           -99.0
845939  Europe   Norway   NaN     Oslo   12.0  31.0  200.0           -99.0

[89 rows x 8 columns]

In [14]:
erase_index = erase_index + list(정답_온도[정답_온도["Year"]==200.0].index)

In [16]:
정답_온도.drop(index=erase_index, inplace=True)

In [17]:
정답_온도["날짜"] = pd.to_datetime(정답_온도[['Day', 'Month', 'Year']].astype(int))

정답_온도.head(1)

In [26]:
정답_온도 = 정답_온도[["Country","City","AvgTemperature","날짜"]]

In [30]:
정답_온도.head(1)

   Country     City  AvgTemperature         날짜
0  Algeria  Algiers            64.2 1995-01-01

In [31]:
정답_온도.rename(columns={"Country" : "국가" ,"City" : "도시" ,"AvgTemperature":"평균 온도"} ,inplace=True)

/tmp/ipykernel_3962/1159610053.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  정답_온도.rename(columns={"Country" : "국가" ,"City" : "도시" ,"AvgTemperature":"평균 온도"} ,inplace=True)

In [33]:
정답_온도.to_csv("정답_온도.csv",index=False)

In [47]:
정답_온도 = pd.read_csv("./정답_온도.csv", dtype={'column_name': object}, low_memory=False)
도시별_지구_온도 = pd.read_csv("./도시별_지구_온도.csv",low_memory=False)
온도 = pd.read_csv("./온도.csv",low_memory=False)

In [50]:
정답_온도.head(1)

        국가       도시  평균 온도          날짜
0  Algeria  Algiers   64.2  1995-01-01

In [51]:
도시별_지구_온도.head(1)

           날짜  평균 온도  평균 온도 불확도     도시       국가     위도     경도
0  1743-11-01  6.068      1.737  Århus  Denmark  57.05  10.33

In [54]:
도시별_지구_온도 = 도시별_지구_온도[도시별_지구_온도["날짜"] >= "1995-01-01"]

In [55]:
도시별_지구_온도.to_csv("도시별_지구_온도.csv",index=False)

# 데이터 전처리 nan값 조절

In [59]:
도시별_지구_온도.shape

(789750, 7)

In [64]:
# 도시별_지구_온도.isnull().sum()

In [63]:
# 도시별_지구_온도[도시별_지구_온도["평균 온도"].isnull()]
# 2013-09-01 꺼만 없으므로 무시한다

In [69]:
온도 = 온도[온도["날짜"] >= "1995-01-01"]

In [71]:
온도.to_csv("온도.csv",index=False)

## 도시별_지구_온도 nan값 채워서 정답_온도와 비교하기

In [72]:
정답_온도 = pd.read_csv("./정답_온도.csv", dtype={'column_name': object}, low_memory=False)
도시별_지구_온도 = pd.read_csv("./도시별_지구_온도.csv",low_memory=False)
온도 = pd.read_csv("./온도.csv",low_memory=False)

In [78]:
온도[온도["평균 온도"].isnull()]["날짜"].unique()

array(['2013-09-01', '2013-10-01', '2013-11-01', '2013-12-01',
       '2014-01-01', '2014-02-01', '2014-03-01', '2014-04-01',
       '2014-05-01', '2014-06-01', '2014-07-01', '2014-08-01',
       '2014-09-01', '2014-10-01', '2014-11-01', '2014-12-01',
       '2015-01-01', '2015-02-01', '2015-03-01', '2015-04-01',
       '2015-05-01', '2015-06-01', '2015-07-01', '2015-08-01',
       '2015-09-01', '2015-10-01', '2015-11-01', '2015-12-01'],
      dtype=object)

In [79]:
온도.head(1)

,날짜,평균 온도,평균 온도 불확도,도시,국가,위도,경도,육지 평균 온도,육지 평균 온도 불확도,육지 최고 온도,육지 최고 온도 불확도,육지 최저 온도,육지 최저 온도 불확도,육지 바다 평균 온도,육지 바다 평균 온도 불확도
0,1995-01-01,0.444,0.438,Århus,Denmark,57.05,10.33,3.54,0.057,8.895,0.151,-1.769,0.173,13.945,0.06